OpenDTEF-v2012/tutorials/multiphase/compressibleInterDyMFoam/laminar/sloshingTank2D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

m4 system/blockMeshDict.m4 > system/blockMeshDict
runApplication blockMesh

restore0Dir

runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
